{
  "title": "Manim for STEM Education: Visualizing Complex Problems Through Animation",
  "authors": [
    {
      "firstname": "Christina",
      "surname": "Zhang",
      "email": "zhan4727@purdue.edu"
    }
  ],
  "abstract": "Many STEM concepts pose significant learning challenges to students due to their inherent complexity and abstract nature. Visualizing complex problems through animations can significantly enhance learning outcomes. However, the creation of animations can be time-consuming and inconvenient. Hence, many educators illustrate complex concepts by hand on a board or a digital device. Although static graphics are helpful for understanding, they are less effective than animations. The free and open-source Python package Manim enables educators to create visually compelling animations easily. Python's straightforward syntax, combined with Manim's comprehensive set of built-in classes and methods, greatly simplifies implementation. This article presents a series of examples that demonstrate how Manim can be used to create animated video lessons for a variety of topics in computer science and mathematics. In addition, it analyzes viewer feedback collected across multiple social media platforms to evaluate the effectiveness and accessibility of these visualizations. The article further explores broader potentials of the Manim Python library by showcasing demonstrations that extend its applications to subject areas beyond computer science and mathematics.",
  "sections": [
    {
      "title": "I. INTRODUCTION",
      "paragraphs": [
        "Many STEM topics are difficult to learn. Visualization often helps significantly to understand these concepts [1]. Previous research shows that animations are more effective than static graphics for enhancing learning outcome [2]. Animations offer students graphical representations that illustrate complex problems and also allow students to engage in the learning process. However, creating animations can be extremely timeconsuming and inconvenient for educators. Hence, educators mostly rely on static graphics when teaching, hand-drawing visualizations for complex problems on boards or digital devices. In addition, some educators try to find animations available online to show their students, but there may not be well-made animations posted online for specific examples that the educator finds necessary to explain.",
        "A free and open-source Python package called Manim allows educators to easily create highly polished and visually compelling animations. The package was developed by Grant Sanderson, the creator of the 3Blue1Brown YouTube channel [3]. It contains many built-in functions that naturally create animations of objects and embeds L A T E X for writing mathematical equations, allowing users to create clear, professional-looking animations with minimal effort. Installation of the Manim package is straightforward. It is sufficient to write code using a basic text editor such as Windows Notepad. Compared to programming languages such as C and Java, Python is much easier to learn. Creating Manim animations-aside from extremely advanced use cases-often only requires knowledge of a small subset of Python syntax. This accessibility opens the tool to educators, students, and STEM professionals with little programming background.",
        "Manim has proven to be effective in educational contexts. A 2024 study by Milorad Marković and Ivan Kaštelan demonstrated its success in visualizing data structures and algorithms in an undergraduate course, with most of the participants reporting that the animations significantly improved their conceptual understanding of the topics [4]. Another 2024 study examined the use of the tool for visualizing parsing algorithms, stating that the visualizations make it easier to understand the steps of parsing [5]. A 2023 pilot study also showed that Manim animations helped electrical and electronic engineering students understand abstract concepts in a Signals and Systems course [6]. Furthermore, the preparation of animation templates allows the autogeneration of explanatory math animations when only a specific math question is given as input from the user [7]. Previous research shows that the integration of a step-by-step solver into the autogeneration system can help generate more types of explanatory math animations and can significantly reduce the time for animation template design [8]. However, many educators may prefer to develop their own explanations of the problems for their students. Hence, writing their own Python code is necessary.",
        "In this paper, I report my experience using the community edition of Manim to create animated video lessons for various topics in computer science and mathematics. The community edition of Manim was forked from Grant Sanderson's GitHub repository 3b1b/manim and developed by the community. This version is recommended for general use because of active community maintenance, feature improvements, and better documentation [3]. Each video lesson I create focuses on a specific problem or topic. This paper describes the detailed process of making these videos, analyzes feedback from viewers on various social media platforms, and demonstrates the potential of using Manim to teach STEM subjects other than computer science and mathematics."
      ],
      "subsections": []
    },
    {
      "title": "II. DESIGN AND IMPLEMENTATION",
      "paragraphs": [],
      "subsections": []
    },
    {
      "title": "A. How to Use Manim",
      "paragraphs": [
        "The community edition of Manim can be installed on a personal computer by following these steps:",
        "1) Install the latest version of Python.",
        "2) Install the dependencies FFmpeg (for video rendering) and L A T E X (for mathematical equations). The command manim -pql example.py Example renders the Example scene from example.py in low quality (480p15) and generates an MP4 file. For higher quality videos, the flags can be set to -pqm (720p30), -pqh (1080p60), or -pqk (2160p60). The message \"Hello World\" is displayed on the screen using a handwriting-style animation. The video pauses for 2 seconds due to the line self.wait (2). Then, the text fades off the screen. Figure 1 shows screenshots of the terminal output and the rendered video. In Manim, any animation must be passed to the function self.play() to be rendered on the screen [3]. Multiple animations can be played at once when passed as arguments to this method. Manim contains many built-in classes such as Circle and Rectangle. It can display images and SVG files on screen. Every rendered Manim video corresponds to a scene class. Each scene class must implement the construct() method, where all animations and objects for that scene are defined. There are many types of scene classes, but Scene is sufficient for creating the majority of animated video lessons. An educator can change this to ThreeDScene if 3-dimensional objects are required, or to MovingCameraScene if a camera that can pan and zoom is needed."
      ],
      "subsections": []
    },
    {
      "title": "B. Creating Animated Video Lessons",
      "paragraphs": [
        "The first step in developing an animated video lesson is to precisely identify the concept or problem to be explained. This could be a sorting algorithm, a chemical reaction, a physics equation, or a proof of a theorem. Once the problem is clearly identified, the next step is to begin developing the explanations and creating the visualizations. It is important to implement the animations when planning each part of the explanation because this allows the educator to actively participate in the learning process, mirroring the student experience. A narration script is not required at this stage. It is clear through the animations what is being explained.",
        "After the animations have been rendered into a full video, the next step involves adding narrations. This step can be skipped if the educator plans to provide the explanation when showing the animation to the students. However, adding narrations eliminates the need for repeated instructor explanations during video playback. Unfortunately, recording narrations is very time-consuming and repetitive. A single misspoken word requires restarting the recording from the beginning. Using a text-to-speech AI model solves this problem. MiniMax AI's text-to-speech AI model generates natural-sounding voices from the user's input text for free [9]. This is the model used for my videos. There are many other models to choose from.",
        "Figure 2 shows the process of explaining the heapsort algorithm in an animated video lesson. The steps involve explaining the heapsort pseudocode in detail, explaining the heapify pseudocode in detail, and animating the process of using heapsort to sort an array of integers. Specific lines of pseudocode are highlighted in the animation when they are explained. Heapsort sorts an array in non-decreasing order by first viewing the entries as nodes of a complete binary tree and building it into a max-heap [10]. In a max-heap, the maximum value is stored at the root (the topmost node). Hence, swapping the root node with the last node places the maximum value at the end of the array. The remaining nodes are built into another max-heap so that the second largest value is at the root. This process is repeated until the entire array is sorted. In the heapsort video, two animations are played at once for each swap: the swapping of nodes in the tree, and the swapping of entries in the array. Showing both animations allows students to visualize the swap in the tree data structure and the corresponding swap in the array to be sorted.  In some cases, it is more appropriate to use a white background. The background color is set to black by default. It can be overwritten in the Python code to other colors. See Figure 4. Figure 5 shows selected frames from two videos that include the visualization of a determinant and an ellipsoid, respectively. The built-in methods and classes make the construction of these scenes straightforward."
      ],
      "subsections": []
    },
    {
      "title": "III. FEEDBACK FROM VIEWERS",
      "paragraphs": [
        "The animated video lessons were shared on YouTube, TikTok, RedNote, and BiliBili. The viewers provided feedback through likes and comments. This section analyzes the feedback and suggests improvements for future videos.",
        "Figure 6 shows key frames from a video that derives the closed-form formula for N k=0 cos kθ. This was the first video to reach over a thousand views on my YouTube channel. The channel had less than 60 subscribers when the video passed a thousand views in 3 days. Viewers of the video left many encouraging comments praising the elegance shown on screen. The video's success stemmed from its engaging structure: (1) the problem was introduced as a question, (2) two important formulas used in the proof were listed upfront before the scene transitions to the detailed derivation steps, and (3) the derived formula is boxed at the end for emphasis. The use of instrumental background music further enhanced engagement, a practice worth retaining. A few videos on data structures and algorithms surpassed 100 likes on TikTok within days. Many viewers also chose to save the videos. Figure 4 contains frames from a video that has more than 200 likes on TikTok. These videos are only 1 to 3 minutes long but cover the topic in a comprehensive way. The combination of animations, narrations, and instrumental background music makes the topic more interesting and easier to understand. Some viewers suggested improvements in the comments section. For instance, one TikTok viewer suggested using a color other than teal for the visualization in Figure 7 because it was difficult to read the labels on the nodes. Another added the suggestion of using a bolder font. These minor improvements can enhance the overall viewing experience and should be applied to future videos. The feedback from viewers on YouTube, TikTok, Red-Note, and Bilibili was mostly positive. Many left encouraging comments and showed support. However, criticisms can also help improve the quality of the content. Clear and concise explanations that cover main points prove to be appreciated by the audience."
      ],
      "subsections": []
    },
    {
      "title": "IV. MANIM BEYOND MATH AND COMPUTER SCIENCE",
      "paragraphs": [
        "So far, the examples discussed are topics from the fields of mathematics and computer science. The animation techniques can be directly extended to physics, chemistry, and other STEM subjects. In this section, examples are provided for demonstrations.",
        "Figure 8 shows a selected frame from a magnetic field animation. The concept of a magnetic field is very important in physics, particularly in electricity and magnetism. Animating it is very straightforward with the Manim ArrowVectorField class. Less than 50 lines of code were used. Physics is the foundation of engineering-the creation of engineering-specific animations is similar to the process of creating physics animations.",
        "Figure 9 shows the animation of a chemical reaction. The chemical equation was written using L A T E X. The Circle class was used to animate the molecules. The blue circles denote hydrogen, and the red circles denote oxygen. The creation of this animation only used 30 lines of code. The equation was first written, followed by the animation of the corresponding molecules. Such animations are also useful in biology, where there are a lot of chemical reactions.",
        "The wide variety of Manim classes and methods makes the tool very efficient in creating animations. It is clear  that visualization can improve the student's understanding of various STEM topics, not limited to computer science and mathematics. The Python package Manim allows educators to generate their own visualizations, addressing the common difficulty of illustrating complex concepts by hand."
      ],
      "subsections": []
    },
    {
      "title": "V. CONCLUSION",
      "paragraphs": [
        "Manim is a very helpful tool for visualizing scientific problems through animations. The simplicity of Python's syntax and the comprehensive set of built-in Manim methods and classes enables educators to easily design and implement their own animations. Most of the feedback from viewers on YouTube, TikTok, RedNote, and BiliBili was positive. There were many encouraging comments. A few suggestions were made regarding the color and font in the visualization, offering valuable feedback for future improvements. Overall, clear and concise explanations were well-received by the audience when accompanied with engaging animations. Educators should consider adopting this visualization tool for teaching STEM courses.",
        "Animation frames shown in this paper are from my YouTube channel: https://www.youtube.com/@ChristinaZhang-c4y."
      ],
      "subsections": []
    }
  ],
  "body_paragraphs": [
    "Many STEM topics are difficult to learn. Visualization often helps significantly to understand these concepts [1]. Previous research shows that animations are more effective than static graphics for enhancing learning outcome [2]. Animations offer students graphical representations that illustrate complex problems and also allow students to engage in the learning process. However, creating animations can be extremely timeconsuming and inconvenient for educators. Hence, educators mostly rely on static graphics when teaching, hand-drawing visualizations for complex problems on boards or digital devices. In addition, some educators try to find animations available online to show their students, but there may not be well-made animations posted online for specific examples that the educator finds necessary to explain.",
    "A free and open-source Python package called Manim allows educators to easily create highly polished and visually compelling animations. The package was developed by Grant Sanderson, the creator of the 3Blue1Brown YouTube channel [3]. It contains many built-in functions that naturally create animations of objects and embeds L A T E X for writing mathematical equations, allowing users to create clear, professional-looking animations with minimal effort. Installation of the Manim package is straightforward. It is sufficient to write code using a basic text editor such as Windows Notepad. Compared to programming languages such as C and Java, Python is much easier to learn. Creating Manim animations-aside from extremely advanced use cases-often only requires knowledge of a small subset of Python syntax. This accessibility opens the tool to educators, students, and STEM professionals with little programming background.",
    "Manim has proven to be effective in educational contexts. A 2024 study by Milorad Marković and Ivan Kaštelan demonstrated its success in visualizing data structures and algorithms in an undergraduate course, with most of the participants reporting that the animations significantly improved their conceptual understanding of the topics [4]. Another 2024 study examined the use of the tool for visualizing parsing algorithms, stating that the visualizations make it easier to understand the steps of parsing [5]. A 2023 pilot study also showed that Manim animations helped electrical and electronic engineering students understand abstract concepts in a Signals and Systems course [6]. Furthermore, the preparation of animation templates allows the autogeneration of explanatory math animations when only a specific math question is given as input from the user [7]. Previous research shows that the integration of a step-by-step solver into the autogeneration system can help generate more types of explanatory math animations and can significantly reduce the time for animation template design [8]. However, many educators may prefer to develop their own explanations of the problems for their students. Hence, writing their own Python code is necessary.",
    "In this paper, I report my experience using the community edition of Manim to create animated video lessons for various topics in computer science and mathematics. The community edition of Manim was forked from Grant Sanderson's GitHub repository 3b1b/manim and developed by the community. This version is recommended for general use because of active community maintenance, feature improvements, and better documentation [3]. Each video lesson I create focuses on a specific problem or topic. This paper describes the detailed process of making these videos, analyzes feedback from viewers on various social media platforms, and demonstrates the potential of using Manim to teach STEM subjects other than computer science and mathematics.",
    "The community edition of Manim can be installed on a personal computer by following these steps:",
    "1) Install the latest version of Python.",
    "2) Install the dependencies FFmpeg (for video rendering) and L A T E X (for mathematical equations). The command manim -pql example.py Example renders the Example scene from example.py in low quality (480p15) and generates an MP4 file. For higher quality videos, the flags can be set to -pqm (720p30), -pqh (1080p60), or -pqk (2160p60). The message \"Hello World\" is displayed on the screen using a handwriting-style animation. The video pauses for 2 seconds due to the line self.wait (2). Then, the text fades off the screen. Figure 1 shows screenshots of the terminal output and the rendered video. In Manim, any animation must be passed to the function self.play() to be rendered on the screen [3]. Multiple animations can be played at once when passed as arguments to this method. Manim contains many built-in classes such as Circle and Rectangle. It can display images and SVG files on screen. Every rendered Manim video corresponds to a scene class. Each scene class must implement the construct() method, where all animations and objects for that scene are defined. There are many types of scene classes, but Scene is sufficient for creating the majority of animated video lessons. An educator can change this to ThreeDScene if 3-dimensional objects are required, or to MovingCameraScene if a camera that can pan and zoom is needed.",
    "The first step in developing an animated video lesson is to precisely identify the concept or problem to be explained. This could be a sorting algorithm, a chemical reaction, a physics equation, or a proof of a theorem. Once the problem is clearly identified, the next step is to begin developing the explanations and creating the visualizations. It is important to implement the animations when planning each part of the explanation because this allows the educator to actively participate in the learning process, mirroring the student experience. A narration script is not required at this stage. It is clear through the animations what is being explained.",
    "After the animations have been rendered into a full video, the next step involves adding narrations. This step can be skipped if the educator plans to provide the explanation when showing the animation to the students. However, adding narrations eliminates the need for repeated instructor explanations during video playback. Unfortunately, recording narrations is very time-consuming and repetitive. A single misspoken word requires restarting the recording from the beginning. Using a text-to-speech AI model solves this problem. MiniMax AI's text-to-speech AI model generates natural-sounding voices from the user's input text for free [9]. This is the model used for my videos. There are many other models to choose from.",
    "Figure 2 shows the process of explaining the heapsort algorithm in an animated video lesson. The steps involve explaining the heapsort pseudocode in detail, explaining the heapify pseudocode in detail, and animating the process of using heapsort to sort an array of integers. Specific lines of pseudocode are highlighted in the animation when they are explained. Heapsort sorts an array in non-decreasing order by first viewing the entries as nodes of a complete binary tree and building it into a max-heap [10]. In a max-heap, the maximum value is stored at the root (the topmost node). Hence, swapping the root node with the last node places the maximum value at the end of the array. The remaining nodes are built into another max-heap so that the second largest value is at the root. This process is repeated until the entire array is sorted. In the heapsort video, two animations are played at once for each swap: the swapping of nodes in the tree, and the swapping of entries in the array. Showing both animations allows students to visualize the swap in the tree data structure and the corresponding swap in the array to be sorted.  In some cases, it is more appropriate to use a white background. The background color is set to black by default. It can be overwritten in the Python code to other colors. See Figure 4. Figure 5 shows selected frames from two videos that include the visualization of a determinant and an ellipsoid, respectively. The built-in methods and classes make the construction of these scenes straightforward.",
    "The animated video lessons were shared on YouTube, TikTok, RedNote, and BiliBili. The viewers provided feedback through likes and comments. This section analyzes the feedback and suggests improvements for future videos.",
    "Figure 6 shows key frames from a video that derives the closed-form formula for N k=0 cos kθ. This was the first video to reach over a thousand views on my YouTube channel. The channel had less than 60 subscribers when the video passed a thousand views in 3 days. Viewers of the video left many encouraging comments praising the elegance shown on screen. The video's success stemmed from its engaging structure: (1) the problem was introduced as a question, (2) two important formulas used in the proof were listed upfront before the scene transitions to the detailed derivation steps, and (3) the derived formula is boxed at the end for emphasis. The use of instrumental background music further enhanced engagement, a practice worth retaining. A few videos on data structures and algorithms surpassed 100 likes on TikTok within days. Many viewers also chose to save the videos. Figure 4 contains frames from a video that has more than 200 likes on TikTok. These videos are only 1 to 3 minutes long but cover the topic in a comprehensive way. The combination of animations, narrations, and instrumental background music makes the topic more interesting and easier to understand. Some viewers suggested improvements in the comments section. For instance, one TikTok viewer suggested using a color other than teal for the visualization in Figure 7 because it was difficult to read the labels on the nodes. Another added the suggestion of using a bolder font. These minor improvements can enhance the overall viewing experience and should be applied to future videos. The feedback from viewers on YouTube, TikTok, Red-Note, and Bilibili was mostly positive. Many left encouraging comments and showed support. However, criticisms can also help improve the quality of the content. Clear and concise explanations that cover main points prove to be appreciated by the audience.",
    "So far, the examples discussed are topics from the fields of mathematics and computer science. The animation techniques can be directly extended to physics, chemistry, and other STEM subjects. In this section, examples are provided for demonstrations.",
    "Figure 8 shows a selected frame from a magnetic field animation. The concept of a magnetic field is very important in physics, particularly in electricity and magnetism. Animating it is very straightforward with the Manim ArrowVectorField class. Less than 50 lines of code were used. Physics is the foundation of engineering-the creation of engineering-specific animations is similar to the process of creating physics animations.",
    "Figure 9 shows the animation of a chemical reaction. The chemical equation was written using L A T E X. The Circle class was used to animate the molecules. The blue circles denote hydrogen, and the red circles denote oxygen. The creation of this animation only used 30 lines of code. The equation was first written, followed by the animation of the corresponding molecules. Such animations are also useful in biology, where there are a lot of chemical reactions.",
    "The wide variety of Manim classes and methods makes the tool very efficient in creating animations. It is clear  that visualization can improve the student's understanding of various STEM topics, not limited to computer science and mathematics. The Python package Manim allows educators to generate their own visualizations, addressing the common difficulty of illustrating complex concepts by hand.",
    "Manim is a very helpful tool for visualizing scientific problems through animations. The simplicity of Python's syntax and the comprehensive set of built-in Manim methods and classes enables educators to easily design and implement their own animations. Most of the feedback from viewers on YouTube, TikTok, RedNote, and BiliBili was positive. There were many encouraging comments. A few suggestions were made regarding the color and font in the visualization, offering valuable feedback for future improvements. Overall, clear and concise explanations were well-received by the audience when accompanied with engaging animations. Educators should consider adopting this visualization tool for teaching STEM courses.",
    "Animation frames shown in this paper are from my YouTube channel: https://www.youtube.com/@ChristinaZhang-c4y."
  ],
  "references": [
    {
      "id": 1,
      "text": "Animation as an Aid to Multimedia Learning\n\t\t\n\t\t\tRichardEMayer\n\t\t\n\t\t\n\t\t\tRoxanaMoreno\n\t\t\n\t\t10.1023/a:1013184611077\n\t\n\t\n\t\tEducational Psychology Review\n\t\tEducational Psychology Review\n\t\t1040-726X\n\t\t1573-336X\n\t\t\n\t\t\t14\n\t\t\t1\n\t\t\t\n\t\t\t2002\n\t\t\tSpringer Science and Business Media LLC"
    },
    {
      "id": 2,
      "text": "Does animation enhance learning? A meta-analysis\n\t\t\n\t\t\tSandraBerney\n\t\t\t0000-0002-6643-9302\n\t\t\n\t\t\n\t\t\tMireilleBétrancourt\n\t\t\n\t\t10.1016/j.compedu.2016.06.005\n\t\n\t\n\t\tComputers & Education\n\t\tComputers & Education\n\t\t0360-1315\n\t\t\n\t\t\t101\n\t\t\t\n\t\t\t2016\n\t\t\tElsevier BV"
    },
    {
      "id": 3,
      "text": "Manim Slides: A Python package for presenting Manim content anywhere\n\t\t\n\t\t\tJéromeEertmans\n\t\t\t0000-0002-5579-5360\n\t\t\n\t\t10.21105/jose.00206\n\t\t\n\t\n\t\n\t\tJournal of Open Source Education\n\t\tJOSE\n\t\t2577-3569\n\t\t\n\t\t\t6\n\t\t\t66\n\t\t\t206\n\t\t\t0.19.0, Jan. 2025\n\t\t\tThe Open Journal"
    },
    {
      "id": 4,
      "text": "Demonstrating the Potential of Visualization in Education with the Manim Python Library: Examples from Algorithms and Data Structures\n\t\t\n\t\t\tMiloradMarković\n\t\t\n\t\t\n\t\t\tIvanKaštelan\n\t\t\n\t\t10.1109/mipro60963.2024.10569661\n\t\n\t\n\t\t2024 47th MIPRO ICT and Electronics Convention (MIPRO)\n\t\t\n\t\t\tIEEE\n\t\t\t2024"
    },
    {
      "id": 5,
      "text": "A Visual Approach to Understand Parsing Algorithms through Python and Manim\n\t\t\n\t\t\tPAkhilesh\n\t\t\n\t\t\n\t\t\tKAmal Krishna\n\t\t\n\t\t\n\t\t\tSKarthickBharadwaj\n\t\t\n\t\t\n\t\t\tDwarapuSubham\n\t\t\n\t\t\n\t\t\tMeenaBelwal\n\t\t\n\t\t10.1109/icccnt61001.2024.10725029\n\t\n\t\n\t\t2024 15th International Conference on Computing Communication and Networking Technologies (ICCCNT)\n\t\t\n\t\t\tIEEE\n\t\t\t2024"
    },
    {
      "id": 6,
      "text": "A pilot study into developing animations for electrical and electronic engineering curriculum\n\t\t\n\t\t\tSSo\n\t\t\n\t\t\n\t\t\tBSchwerin\n\t\t\n\t\t\n\t\t\tDRowlands\n\t\t\n\t\t\n\t\t\tHEspinosa\n\t\t\n\t\t\n\t\t\tTTadj\n\t\t\n\t\t\n\t\t\tABusch\n\t\t\n\t\n\t\n\t\t34th Australasian Association for Engineering Education Conference (AAEE2023), Engineers Australia Gold Coast\n\t\t\n\t\t\t2023"
    },
    {
      "id": 7,
      "text": "Autogeneration of Explanatory Math Animation\n\t\t\n\t\t\tTzung-ShengYang\n\t\t\n\t\t\n\t\t\tWei-ChiaHuang\n\t\t\n\t\t\n\t\t\tI.-WLai\n\t\t\n\t\t10.1109/tale54877.2022.00128\n\t\n\t\n\t\t2022 IEEE International Conference on Teaching, Assessment and Learning for Engineering (TALE)\n\t\t\n\t\t\tIEEE\n\t\t\t2022"
    },
    {
      "id": 8,
      "text": "Efficient Explanatory Math Animation Generating with the Integration of the Step-by-step Solver\n\t\t\n\t\t\tWei-ChiaHuang\n\t\t\n\t\t\n\t\t\tTzung-ShengYang\n\t\t\n\t\t\n\t\t\tI.-WLai\n\t\t\n\t\t10.1109/icce-taiwan58799.2023.10226735\n\t\n\t\n\t\t2023 International Conference on Consumer Electronics - Taiwan (ICCE-Taiwan)\n\t\t\n\t\t\tIEEE\n\t\t\t2023\n\t\t\t\n\t\t\n\t\t\n\t\t\tICCE-Taiwan"
    },
    {
      "id": 9,
      "text": "Minimax\n\t\t\n\t\t\n\t\tMiniMax Text-to-Speech AI Model, version Speech-02\n\t\t\n\t\t\tApr. 2025"
    },
    {
      "id": 10,
      "text": "Algorithm 232: Heapsort\n\t\t\n\t\t\tJW JWilliams\n\t\t\n\t\t10.1145/512274.3734138\n\t\n\t\n\t\tCommunications of the ACM\n\t\tCommun. ACM\n\t\t0001-0782\n\t\t1557-7317\n\t\t\n\t\t\t7\n\t\t\t6\n\t\t\t\n\t\t\t1964\n\t\t\tAssociation for Computing Machinery (ACM)"
    }
  ],
  "formulas": []
}